blog/app/controllers/articles_controller.rb

  def create
    #render plain: params[:article].inspect
    # !!@article = Article.new(params[:article])
    # @article = Article.new(params.require(:article).permit(:title, :text))

    @article = Article.new(article_params)

    #@article.save
    #redirect_to @article
    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "vikmail@ua.fm"], ["text", "asdasd"], ["created_at", "2015-08-12 15:41:50.999713"], ["updated_at", "2015-08-12 15:41:50.999713"]]